simple.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:textrec xmlns:ns1="urn:WSLim5APIntf-IWSLim5AP"
			soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<xcrec xsi:type="xsd:string">test</xcrec>
		</ns1:textrec>
	</soapenv:Body>
</soapenv:Envelope>
